DataProcessors/абс_ГрупповаяПечатьДокументов/абс_ГрупповаяПечатьДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>абс_ГрупповаяПечатьДокументов</name>
  <attributes>
    <name>ПредварительныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьТМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьДоверенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьПутевыеЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьТранспортныеНакладные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьСводныеДоверенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьТТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЭкспедиторскойРасписки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

InformationRegisters/абс_НастройкиПечатиКомплектаОтгрузочныхДокументов/абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиПечатиКомплектаОтгрузочныхДокументов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатнаяФорма</name>
    <type>
      <types>CatalogRef.ВнешниеОбработки</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЭкземпляровПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлючПараметровПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыводитьГрузополучателя</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидАдресаГрузополучателя</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ВидАдресаДоставки</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </resources>
  <resources>
    <name>ВыводитьАдресДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПечатнойФормы</name>
    <type>
      <types>CatalogRef.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Documents/абс_СводнаяЗаявкаНаТранспорт/абс_СводнаяЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СводнаяЗаявкаНаТранспорт</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>ТранспортныйМаршрут</name>
      <type>
        <types>DocumentRef.абс_ТранспортныйМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ТранспортныйМаршрут/абс_ТранспортныйМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ТранспортныйМаршрут</name>
  <attributes>
    <name>СводнаяЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_СводнаяЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.абс_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТКПеревозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоручениеЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТранспортногоМаршрута</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьДоверенность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DocumentRef.Доверенность</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/Доверенность/Доверенность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доверенность</name>
  <comment>(Общ)</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.СчетНаОплатуПоставщика</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДействия</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаПолучениеОт</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоДокументу</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДокументОснование</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КорешокДоверенностиПолучен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВыводитьТабличнуюЧастьСтрокой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидДоверенности</name>
    <type>
      <types>EnumRef.абс_ВидыДоверенностей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>НаименованиеТовара</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаПоКлассификатору</name>
      <comment>(Общ)</comment>
      <type>
        <types>String</types>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов/абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов</name>
  <predefined>
    <items>
      <name>Доверенность</name>
      <description>Доверенность</description>
    </items>
    <items>
      <name>ЗаказПокупателя</name>
      <description>Заказ покупателя</description>
    </items>
    <items>
      <name>ИзображенияСертификатов</name>
      <description>Изображения сертификатов</description>
    </items>
    <items>
      <name>ПаллетнаяЭтикетка</name>
      <description>Паллетная этикетка</description>
    </items>
    <items>
      <name>РеестрСертификатов</name>
      <description>Реестр сертификатов</description>
    </items>
    <items>
      <name>СчетНаОплату</name>
      <description>Счет на оплату</description>
    </items>
    <items>
      <name>СчетФактура</name>
      <description>Счет-фактура</description>
    </items>
    <items>
      <name>ТоварнаяНакладная</name>
      <description>Товарная накладная</description>
    </items>
    <items>
      <name>ТТН</name>
      <description>ТТН</description>
    </items>
  </predefined>
</mdclass:Catalog>

DataProcessors/абс_ГрупповаяПечатьДокументов/Forms/Форма/Module.bsl
Процедура ЗаполнитьДеревоМаршрутов(СводнаяЗаявкаНаТранспорт)
	
	Дерево=РеквизитФормыВЗначение("ДеревоМаршрутов");
	Дерево.Строки.Очистить();
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	абс_ТранспортныйМаршрутЗадания.Доверенность КАК Доверенность,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут КАК Маршрут,
	|	абс_ТранспортныйМаршрутЗадания.Доверенность.Представление,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.Представление КАК МаршрутПредставление,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ВодительЭкспедитор.Представление КАК ВодительПредставление,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Представление,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Контрагент.Представление КАК КонтрагентПредставление
	|ИЗ
	|	Документ.абс_СводнаяЗаявкаНаТранспорт.Маршруты КАК абс_СводнаяЗаявкаНаТранспортМаршруты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|		ПО абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут = абс_ТранспортныйМаршрутЗадания.Ссылка
	|ГДЕ
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.Ссылка = &СводнаяЗаявкаНаТранспорт
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут,
	|	абс_ТранспортныйМаршрутЗадания.Доверенность,
	|	абс_ТранспортныйМаршрутЗадания.Доверенность.Представление,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.Представление,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут.ВодительЭкспедитор.Представление,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт.Представление
	|ИТОГИ ПО
	|	Маршрут";
	Запрос.УстановитьПараметр("СводнаяЗаявкаНаТранспорт",СводнаяЗаявкаНаТранспорт);
	ВыборкаМаршрут=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	сч=0;
	Пока ВыборкаМаршрут.Следующий() Цикл
		Если ВыборкаМаршрут.Маршрут.Пустая() Тогда 
			Продолжить;
		КонецЕсли;
		//транспортный маршрут
		СтрокаМаршрута = Дерево.Строки.Добавить();
		СтрокаМаршрута.Док					= ВыборкаМаршрут.Маршрут;
		СтрокаМаршрута.Представление		= ВыборкаМаршрут.МаршрутПредставление;
		СтрокаМаршрута.Пометка				= Истина;
		СтрокаМаршрута.НомерСтрокиСписка	= Сч;
		СтрокаМаршрута.Водитель 			= ВыборкаМаршрут.ВодительПредставление;
		
		ТабДокумент = Документы.абс_ТранспортныйМаршрут.ПечатьМаршрута(ВыборкаМаршрут.Маршрут);
		
		СписокТабличныхДокументов.Добавить(ТабДокумент);
		Сч=Сч+1;
		
		//путевой лист
		СтрокаПутевойЛист=СтрокаМаршрута.Строки.Добавить();
		СтрокаПутевойЛист.Док				= ВыборкаМаршрут.Маршрут;
		СтрокаПутевойЛист.Представление		= "Путевой лист";
		СтрокаПутевойЛист.Пометка			= Ложь;
		СтрокаПутевойЛист.НомерСтрокиСписка	= Сч;
		СтрокаПутевойЛист.Водитель			= ВыборкаМаршрут.ВодительПредставление;
		
		ТабДокумент = Документы.абс_ТранспортныйМаршрут.ПечатьПутевогоЛиста(ВыборкаМаршрут.Маршрут);
		СписокТабличныхДокументов.Добавить(ТабДокумент);
		Сч=Сч+1;

		//доверенность
		Выборка=ВыборкаМаршрут.Выбрать();
		Пока Выборка.Следующий() Цикл
		//	сообщить("Маршрут "+Выборка.Маршрут);
			// {Лео Катанович 18.07.2016
			//Если Не Выборка.Доверенность.Пустая() Тогда
			Если ЗначениеЗаполнено(Выборка.Доверенность) Тогда
			// Лео Катанович}
				СтрокаДоверенность = СтрокаМаршрута.Строки.Добавить();
				СтрокаДоверенность.Док					= Выборка.Доверенность;
				СтрокаДоверенность.Представление		= Выборка.ДоверенностьПредставление;
		        // {Лео Катанович  (05.07.2016 по просьбе Марчука Д.)
				//СтрокаДоверенность.Пометка		    = Истина;
				СтрокаДоверенность.Пометка				= Ложь;
		        // Лео Катанович}
				СтрокаДоверенность.НомерСтрокиСписка	= Сч;
				СтрокаДоверенность.Водитель				= ВыборкаМаршрут.ВодительПредставление;
				СтрокаДоверенность.Контрагент			= Выборка.КонтрагентПредставление;
				
				ТабДокумент=Документы.Доверенность.ПечатьДоверенности(Выборка.Доверенность);
				СписокТабличныхДокументов.Добавить(ТабДокумент);
				Сч=Сч+1;
				
			КонецЕсли;
			//транспортная накладная
			//СтрокаНакладная = СтрокаМаршрута.Строки.Добавить();
			//СтрокаНакладная.Док					= Выборка.ЗаявкаНаТранспорт;
			//СтрокаНакладная.Представление		= "Транспортная накладная";
			//СтрокаНакладная.Пометка				= Истина;
			//СтрокаНакладная.НомерСтрокиСписка	= Сч;
			//СтрокаНакладная.Водитель			= ВыборкаМаршрут.ВодительПредставление;
			//СтрокаНакладная.Контрагент			= Выборка.КонтрагентПредставление;
			//
			//ТабДокумент = Документы.абс_ТранспортныйМаршрут.ПечатьТранспортнойНакладной(СводнаяЗаявкаНаТранспорт, Выборка.Маршрут, Выборка.ЗаявкаНаТранспорт);
			//
			//ТабДокумент.КоличествоЭкземпляров = 4;
			//
			//СписокТабличныхДокументов.Добавить(ТабДокумент);
			//Сч=Сч+1;
			//Катанович 0512
		//	Попытка
		//		СвойствоПечататьТТН = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ПечататьТТН");
		//		ПечататьТТН_Значение = абс_Дистрибуция.ПолучитьЗначениеСвойстваОбъекта(Выборка.ЗаявкаНаТранспорт.ДокументОтгрузки.Грузополучатель, СвойствоПечататьТТН);
		//		ПечататьТТН = ?(ЗначениеЗаполнено(ПечататьТТН_Значение), ПечататьТТН_Значение, Истина);
		//	Исключение
		//		ПечататьТТН = Истина;
		//	КонецПопытки;
		//
		//	Если ПечататьТТН Тогда
				//Если ПечататьТТН = Истина Тогда
					СтрокаНакладная = СтрокаМаршрута.Строки.Добавить();
					СтрокаНакладная.Док					= Выборка.ЗаявкаНаТранспорт;
					СтрокаНакладная.Представление		= "Транспортная накладная";
					СтрокаНакладная.Пометка				= Истина;
					СтрокаНакладная.НомерСтрокиСписка	= Сч;
					СтрокаНакладная.Водитель			= ВыборкаМаршрут.ВодительПредставление;
					СтрокаНакладная.Контрагент			= Выборка.КонтрагентПредставление;
					
					ТабДокумент = Документы.абс_ТранспортныйМаршрут.ПечатьТранспортнойНакладной(СводнаяЗаявкаНаТранспорт, Выборка.Маршрут, Выборка.ЗаявкаНаТранспорт);
					//количество ТТН Зароднюк
					ТабДокумент.КоличествоЭкземпляров = 4;
					
					СписокТабличныхДокументов.Добавить(ТабДокумент);
					Сч=Сч+1;
					
			//	КонецЕсли;	
			//КонецЕсли;	
			//Катанович 0512

			//ТТН
		//	 сообщить(ВыборкаМаршрут.Маршрут);

		//	сообщить(Выборка.ЗаявкаНаТранспорт);
		//	сообщить(Выборка.ЗаявкаНаТранспорт.ДокументОтгрузки);
			Если ЗначениеЗаполнено(Выборка.ЗаявкаНаТранспорт.ДокументОтгрузки) Тогда        		//проверить тип//
				СтруктураВнешнейОбработки = ПолучитьФайлВнешнейОбработки(Выборка.ЗаявкаНаТранспорт.ДокументОтгрузки);
				СсылкаНаВнешнююОбработку = СтруктураВнешнейОбработки.Обработка;
				Если ЗначениеЗаполнено(СсылкаНаВнешнююОбработку) Тогда
					СтрокаНакладная = СтрокаМаршрута.Строки.Добавить();
					СтрокаНакладная.Док					= Выборка.ЗаявкаНаТранспорт.ДокументОтгрузки;
					СтрокаНакладная.Представление		= "ТТН";
					СтрокаНакладная.Пометка				= Истина;
					СтрокаНакладная.НомерСтрокиСписка	= Сч;
					СтрокаНакладная.Водитель			= ВыборкаМаршрут.ВодительПредставление;
					СтрокаНакладная.Контрагент			= Выборка.КонтрагентПредставление;
					Попытка
					      ТабДокумент =  НапечататьВнешнююФормуТТН(СсылкаНаВнешнююОбработку,Выборка.ЗаявкаНаТранспорт.ДокументОтгрузки);
					      ТабДокумент.КоличествоЭкземпляров = СтруктураВнешнейОбработки.КоличествоЭкземпляровПечати;
						  ТабДокумент.АвтоМасштаб = Истина;
						  СписокТабличныхДокументов.Добавить(ТабДокумент);
					      Сч=Сч+1;
					  Исключение
					КонецПопытки;	  
				КонецЕсли;	
			КонецЕсли;	

		КонецЦикла;
		
		// {Лео Катанович  (05.07.2016 по просьбе Марчука Д. добавлена печатная форма сводной доверенности)
		// Сводная Доверенность
		ТабДокумент = Документы.абс_ТранспортныйМаршрут.ПечатьСводнойДоверенности(ВыборкаМаршрут.Маршрут);
		Если ТабДокумент <> Неопределено Тогда
			СтрокаСводнаяДоверенность = СтрокаМаршрута.Строки.Добавить();
			СтрокаСводнаяДоверенность.Док				= ВыборкаМаршрут.Маршрут;
			СтрокаСводнаяДоверенность.Представление		= "Сводная доверенность";
			СтрокаСводнаяДоверенность.Пометка			= Ложь;
			СтрокаСводнаяДоверенность.НомерСтрокиСписка	= Сч;
			СтрокаСводнаяДоверенность.Водитель			= ВыборкаМаршрут.ВодительПредставление;
			СписокТабличныхДокументов.Добавить(ТабДокумент);
			Сч=Сч+1;
		КонецЕсли;	
		// Лео Катанович}

		
		// +Лео Сафонов  по просьбе Марчука Д. добавлена печатная форма "Экспедиторская расписка"
		// Экспедиторская расписка 
		
		// +Лео zhiga, для каждой Организации своя "Экспедиторская расписка" (Убоженко Ю.) 
		мОрганизаций = ПолучитьОрганизацииПоМаршруту(ВыборкаМаршрут.Маршрут);
		Для каждого орг из мОрганизаций цикл
		
		ТабДокумент = Документы.абс_ТранспортныйМаршрут.ПечатьЭкспедиторскаяРасписка(ВыборкаМаршрут.Маршрут,орг);
		Если ТабДокумент <> Неопределено Тогда
			СтрокаСводнаяДоверенность = СтрокаМаршрута.Строки.Добавить();
			СтрокаСводнаяДоверенность.Док				= ВыборкаМаршрут.Маршрут;
			СтрокаСводнаяДоверенность.Представление		= "Экспедиторская расписка";
			СтрокаСводнаяДоверенность.Пометка			= Истина;
			СтрокаСводнаяДоверенность.НомерСтрокиСписка	= Сч;
			СтрокаСводнаяДоверенность.Водитель			= ВыборкаМаршрут.ВодительПредставление;
			СписокТабличныхДокументов.Добавить(ТабДокумент);
			Сч=Сч+1;
		КонецЕсли;	
		// -Лео Сафонов

		КонецЦикла;

		
	КонецЦикла;
	
	ЗначениеВРеквизитформы(Дерево,"ДеревоМаршрутов");
	
КонецПроцедуры


//&НаКлиенте
Функция ПолучитьОрганизацииПоМаршруту(Маршрут)
	
	мОрг = Новый Массив;
	Для каждого зз из Маршрут.Задания цикл
		Если мОрг.Найти(зз.ЗаявкаНаТранспорт.Организация) = неопределено тогда
		мОрг.Добавить(зз.ЗаявкаНаТранспорт.Организация);
		КонецЕсли;
	КонецЦикла;
	
	возврат мОрг
	
КонецФункции

&НаКлиенте
Процедура ДеревоМаршрутовПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;
	//ТабДок=ПолучитьТабличныйДокументПоНомеру(Элемент.ТекущиеДанные.НомерСтрокиСписка)
	ТабДок = ПолучитьТабличныйДокументПоНомеруНаКлиенте(Элемент.ТекущиеДанные.НомерСтрокиСписка) // zhiga
КонецПроцедуры


&НаКлиенте
Функция ПолучитьТабличныйДокументПоНомеруНаКлиенте(Номер)
	ЭлементСписка=СписокТабличныхДокументов.НайтиПоИдентификатору(Номер);
	Если ЭлементСписка=Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭлементСписка.Значение;
	КонецЕсли;
КонецФункции



&НаСервере
Функция ПолучитьТабличныйДокументПоНомеру(Номер)
	ЭлементСписка=СписокТабличныхДокументов.НайтиПоИдентификатору(Номер);
	Если ЭлементСписка=Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат ЭлементСписка.Значение;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СводнаяЗаявкаНаТранспорт") Тогда
		ЗаполнитьДеревоМаршрутов(Параметры.СводнаяЗаявкаНаТранспорт);
	КонецЕсли;
	
	Объект.ПечататьТМ					 = Истина;
	// {Лео Катанович
	//Объект.ПечататьДоверенности		 = Истина;
	Объект.ПечататьДоверенности			 = Ложь;
	Объект.ПечататьСводныеДоверенности   = Ложь;
	Объект.ПечатьЭкспедиторскойРасписки  = Истина;

	Объект.ПечататьТТН = Истина;
	// Лео Катанович}
	Объект.ПечататьПутевыеЛисты			 = Ложь;
	Объект.ПечататьТранспортныеНакладные = Истина;
	Объект.ПредварительныйПросмотр 		 = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМаршрутовДокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМаршрутовДокОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьГруппы(Команда)
	ТабДокументов = ПолучитьТаблицуДокументов();
	
	Для Каждого Стр ИЗ ТабДокументов Цикл
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("Автомасштаб",Истина);
		Если ТипЗнч(Стр.Док)=Тип("ДокументСсылка.абс_ТранспортныйМаршрут") Тогда
			ПараметрыПечати.Вставить("ОриентацияСтраницы",ОриентацияСтраницы.Ландшафт);
		ИначеЕсли ТипЗнч(Стр.Док)=Тип("ДокументСсылка.Доверенность") Тогда
			ПараметрыПечати.Вставить("ОриентацияСтраницы",ОриентацияСтраницы.Портрет);
		//+ Никитин	
		ИначеЕсли ТипЗнч(Стр.Док)=Тип("ДокументСсылка.абс_СводнаяЗаявкаНаТранспорт") Тогда
	        ПараметрыПечати.Вставить("РазборПоКопиям"				, Истина);
		КонецЕсли;		
		//Никитин
	
			
			
		ПараметрыПечати.Вставить("ОтображатьЗаголовки"			, Ложь);
		ПараметрыПечати.Вставить("ОтображатьСетку"				, Ложь);
		ПараметрыПечати.Вставить("ТолькоПросмотр"				, Истина);
		ПараметрыПечати.Вставить("Защита"						, Ложь);
		ПараметрыПечати.Вставить("ИмяПараметровПечати"			, "");
		//{Лео Катанович
		
		Если  Стр.Представление = "Транспортная накладная" Тогда
			КоличествоЭкземпляров =  3;
		ИначеЕсли Стр.Представление = "ТТН" Тогда
			КоличествоЭкземпляров = Стр.ТабДок.КоличествоЭкземпляров;
			//КоличествоЭкземпляров =  5;
		Иначе
			КоличествоЭкземпляров =  1;
		КонецЕсли;
					
		//Лео Катанович}

	  
		УниверсальныеМеханизмы.НапечататьДокумент(Стр.ТабДок, КоличествоЭкземпляров, Не Объект.ПредварительныйПросмотр, Стр.Представление, Стр.Док, ПараметрыПечати);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуДокументов()
	
	Дерево = РеквизитФормыВЗначение("ДеревоМаршрутов");
	
	ТабДокументов = Новый ТаблицаЗначений;
	ТабДокументов.Колонки.Добавить("ТабДок");
	ТабДокументов.Колонки.Добавить("Док");
	ТабДокументов.Колонки.Добавить("Представление");
	
	Для Каждого СтрокаМаршрут из Дерево.Строки Цикл
		
		Если Объект.ПечататьТМ и СтрокаМаршрут.Пометка Тогда
			ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаМаршрут.НомерСтрокиСписка);
			Если Не ТекТабДокумент = Неопределено Тогда
				НоваяСтрока						= ТабДокументов.Добавить();
				НоваяСтрока.ТабДок				= ТекТабДокумент;
				НоваяСтрока.Док					= СтрокаМаршрут.Док;
				НоваяСтрока.Представление		= СтрокаМаршрут.Представление;
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого СтрокаДоверенность Из СтрокаМаршрут.Строки Цикл
			Если Объект.ПечататьДоверенности и СтрокаДоверенность.Пометка и ТипЗнч(СтрокаДоверенность.Док) = Тип("ДокументСсылка.Доверенность") Тогда
				ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаДоверенность.НомерСтрокиСписка);
				Если Не ТекТабДокумент = Неопределено Тогда
					НоваяСтрока					= ТабДокументов.Добавить();
					НоваяСтрока.ТабДок			= ТекТабДокумент;
					НоваяСтрока.Док				= СтрокаДоверенность.Док;
					НоваяСтрока.Представление 	= СтрокаДоверенность.Представление;
				КонецЕсли;
			КонецЕсли;
			
			Если Объект.ПечататьПутевыеЛисты и СтрокаМаршрут.Пометка и СтрокаДоверенность.Представление="Путевой лист" Тогда
				ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаДоверенность.НомерСтрокиСписка);
				Если Не ТекТабДокумент = Неопределено Тогда
					НоваяСтрока = ТабДокументов.Добавить();
					НоваяСтрока.ТабДок 			= ТекТабДокумент;
					НоваяСтрока.Док				= СтрокаМаршрут.Док;
					НоваяСтрока.Представление	= СтрокаДоверенность.Представление;
				КонецЕсли;
			КонецЕсли;
			
			Если Объект.ПечататьТранспортныеНакладные и СтрокаМаршрут.Пометка и ТипЗнч(СтрокаДоверенность.Док) = Тип("ДокументСсылка.абс_ЗаявкаНаТранспорт") Тогда
				ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаДоверенность.НомерСтрокиСписка);
				Если Не ТекТабДокумент=Неопределено Тогда
					НоваяСтрока					= ТабДокументов.Добавить();
					НоваяСтрока.ТабДок			= ТекТабДокумент;
					НоваяСтрока.Док				= СтрокаДоверенность.Док;
					НоваяСтрока.Представление 	= "Транспортная накладная";
				КонецЕсли;
			КонецЕсли;
			
			// {Лео Катанович
			Если Объект.ПечататьСводныеДоверенности и СтрокаДоверенность.Пометка и СтрокаДоверенность.Представление = "Сводная доверенность" Тогда
				ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаДоверенность.НомерСтрокиСписка);
				Если Не ТекТабДокумент=Неопределено Тогда
					НоваяСтрока					= ТабДокументов.Добавить();
					НоваяСтрока.ТабДок			= ТекТабДокумент;
					НоваяСтрока.Док				= СтрокаДоверенность.Док;
					НоваяСтрока.Представление 	= СтрокаДоверенность.Представление;
				КонецЕсли;
			КонецЕсли;
			Если Объект.ПечататьТТН и СтрокаДоверенность.Пометка и СтрокаДоверенность.Представление = "ТТН" Тогда
				ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаДоверенность.НомерСтрокиСписка);
				Если Не ТекТабДокумент = Неопределено Тогда
					НоваяСтрока					= ТабДокументов.Добавить();
					НоваяСтрока.ТабДок			= ТекТабДокумент;
					НоваяСтрока.Док				= СтрокаДоверенность.Док;
					НоваяСтрока.Представление 	= СтрокаДоверенность.Представление;
				КонецЕсли;
			КонецЕсли;
			// Лео Катанович}
			//+Лео Сафрнов Е А
			Если Объект.ПечатьЭкспедиторскойРасписки и СтрокаДоверенность.Пометка и СтрокаДоверенность.Представление = "Экспедиторская расписка" Тогда
				ТекТабДокумент = ПолучитьТабличныйДокументПоНомеру(СтрокаДоверенность.НомерСтрокиСписка);
				Если Не ТекТабДокумент=Неопределено Тогда
					НоваяСтрока					= ТабДокументов.Добавить();
					НоваяСтрока.ТабДок			= ТекТабДокумент;
					НоваяСтрока.Док				= СтрокаДоверенность.Док;
					НоваяСтрока.Представление 	= СтрокаДоверенность.Представление;
				КонецЕсли;
			КонецЕсли;
			//-Лео Сафрнов Е А

		КонецЦикла;
	КонецЦикла;
	
	Возврат ТабДокументов;
	
КонецФункции

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	УстановитьПометки(Истина);
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьПометки(Пометка)
	Для каждого СтрокаМаршрут из ДеревоМаршрутов.ПолучитьЭлементы() Цикл
		СтрокаМаршрут.Пометка = Пометка;
		Для каждого СтрокаДокумент из СтрокаМаршрут.ПолучитьЭлементы() Цикл
			СтрокаДокумент.Пометка = Пометка;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	УстановитьПометки(Ложь);
КонецПроцедуры

Функция НапечататьВнешнююФормуТТН(СсылкаНаВнешнююОбработку, СсылкаНаОбъект)
	

	ДвоичныеДанные = СсылкаНаВнешнююОбработку.ХранилищеВнешнейОбработки.Получить();
	
	Если ДвоичныеДанные = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Неопределено;
	
	ИмяФайла = ПолучитьИмяВременногоФайла("epf");
	Попытка
		ДвоичныеДанные.Записать(ИмяФайла);
		Обработка = ВнешниеОбработки.Создать(ИмяФайла);
		Обработка.СсылкаНаОбъект = СсылкаНаОбъект;
		
		
		ТабДокумент = Обработка.Печать();
		УдалитьФайлы(ИмяФайла);
	Исключение
		ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, "Не удалось сформировать внешнюю печатную форму!");
	КонецПопытки;
	
	Возврат ТабДокумент;
	
КонецФункции

&НаСервере
Функция ПолучитьФайлВнешнейОбработки(ДокументРеализации)
	
	Обработка = Неопределено;
	КоличествоЭкземпляровПечати = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Контрагент
	|ПОМЕСТИТЬ Контрагенты
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&Реализации)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслуг.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ТипПечатнойФормы КАК ТипПечатнойФормы,
	|	ИСТИНА КАК Пометка,
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ПечатнаяФорма,
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.КоличествоЭкземпляровПечати,
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.Использовать
	|ИЗ
	|	Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_НастройкиПечатиКомплектаОтгрузочныхДокументов.СрезПоследних КАК абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних
	|		ПО (Контрагенты.Контрагент = абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.Контрагент
	|				ИЛИ абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|ГДЕ
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ТипПечатнойФормы = &ТипПечатнойФормы
	|
	|СГРУППИРОВАТЬ ПО
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ТипПечатнойФормы,
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ПечатнаяФорма,
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.КоличествоЭкземпляровПечати,
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.Использовать
	|
	|УПОРЯДОЧИТЬ ПО
	|	абс_НастройкиПечатиКомплектаОтгрузочныхДокументовСрезПоследних.ТипПечатнойФормы.Наименование";

	
	Запрос.УстановитьПараметр("Реализации", ДокументРеализации);	
	Запрос.УстановитьПараметр("ТипПечатнойФормы", Справочники.абс_ТипыПечатныхФормКомплектаОтгрузочныхДокументов.ТТН);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Использовать Тогда
		     Обработка = Выборка.ПечатнаяФорма;
		     КоличествоЭкземпляровПечати = Выборка.КоличествоЭкземпляровПечати;
		КонецЕсли;	 
	КонецЕсли;
	
	СтруктураОбработки = Новый Структура("Обработка, КоличествоЭкземпляровПечати", Обработка, КоличествоЭкземпляровПечати);
	
	Возврат СтруктураОбработки;
КонецФункции
